tap "adoptopenjdk/openjdk"
tap "caskroom/cask"

# General commands
brew "autossh"
brew "awscli"
brew "cask"
brew "cloc"
brew "dep"
brew "emacs"
brew "go"
brew "ghq"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "ispell"
brew "jq"
brew "mas"
brew "node"
brew "pdsh"
brew "peco"
brew "terraform"
brew "tree"
brew "watch"
brew "zsh"
brew "zsh-completions"

# General apps
cask "1password"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "charles"
cask "clipy"
cask "dash"
cask "deckset"
cask "fliqlo"
cask "flux"
cask "focus"
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "licecap"
cask "ngrok"
cask "nordvpn"
cask "postman"
cask "sequel-pro"
cask "skitch"
cask "skype"
cask "slack"
cask "spotify"
cask "spectacle"
cask "timing"
cask "yubico-yubikey-manager"
cask "visual-studio-code"

mas "MindNode 5", id: 1289197285

# Python
brew "pyenv"
brew "python"

# Ruby
brew "ruby-build"
brew "rbenv"
brew "ruby"

# Scala
brew "sbt"
cask "adoptopenjdk8"
cask "intellij-idea-ce"
