# General commands
brew "autossh"
brew "cloc"
brew "gh"
brew "ghq"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "mas"
brew "node"
brew "pdsh"
brew "peco"
brew "pv"
brew "shellcheck"
brew "tmux"
brew "terraform"
brew "tree"
brew "watch"

# GNU
brew "coreutils"
brew "grep"
brew "gnu-sed"

# General apps
cask "1password"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "charles"
cask "clipy"
cask "dash"
cask "deckset"
cask "docker"
cask "dozer"
cask "fliqlo"
cask "flux"
cask "focus"
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "kindle"
cask "licecap"
cask "native-access"
cask "ngrok"
cask "nordvpn"
cask "postman"
cask "sequel-ace"
cask "skitch"
cask "skype"
cask "slack"
cask "spotify"
cask "rectangle"
cask "timing"
cask "yubico-yubikey-manager"
cask "visual-studio-code"
cask "zotero"

mas "MindNode 5", id: 1289197285

# Zsh
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Python
brew "pyenv"
brew "python"

# Ruby
brew "ruby-build"
brew "rbenv"
brew "ruby"

# Scala
brew "sbt"
cask "adoptopenjdk8"
cask "intellij-idea-ce"

# Go
brew "go"

# Rust
brew "rustup"

# AWS
brew "awscli"
cask "session-manager-plugin"

# Kubernetes
brew "kubernetes-cli"
brew "helm"
