tap "homebrew/cask-drivers"

# General commands
brew "autossh"
brew "cloc"
brew "gh"
brew "ghq"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "mas"
brew "node"
brew "pdsh"
brew "peco"
brew "pv"
brew "shellcheck"
brew "switchaudio-osx"
brew "tmux"
brew "terraform"
brew "tree"
brew "watch"

# GNU
brew "coreutils"
brew "grep"
brew "gnu-sed"

# General apps
cask "1password"
cask "alt-tab"
cask "appcleaner"
cask "clipy"
cask "dash"
cask "deckset"
cask "dozer"
cask "https://raw.githubusercontent.com/Homebrew/homebrew-cask/c586cb7d81f922fcb602f091dcc902715ffdeef7/Casks/focus.rb"
cask "google-chrome"
cask "google-drive-file-stream"
cask "grammarly-desktop"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "logitech-options"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "rectangle"
cask "yubico-yubikey-manager"
cask "visual-studio-code"

# Zsh
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Python
brew "pyenv"
brew "python"

# Ruby
brew "ruby-build"
brew "ruby"

# Go
brew "go"

# Rust
brew "rustup"

# AWS
brew "awscli"
cask "session-manager-plugin"

# Kubernetes
brew "kubernetes-cli"
brew "helm"
