tap "adoptopenjdk/openjdk"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
brew "autossh"
brew "awscli"
brew "carthage"
brew "emacs"
brew "cask"
brew "cloc"
brew "go"
brew "dep"
brew "docker"
brew "python"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-machine", restart_service: true
brew "docker-machine-nfs"
brew "ghq"
brew "git-lfs"
brew "gnupg"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "node"
brew "ios-sim"
brew "ipmitool"
brew "ispell"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "minikube"
brew "pdsh"
brew "peco"
brew "pinentry-mac"
brew "pwgen"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "sbt"
brew "terraform"
brew "tree"
brew "v8"
brew "v8@3.15"
brew "vault"
brew "watch"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "adoptopenjdk8"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "charles"
cask "clipy"
cask "dash"
cask "deckset"
cask "fliqlo"
cask "flux"
cask "focus"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "intellij-idea-ce"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "kensington-trackball-works"
cask "licecap"
cask "logitech-options"
cask "macdown"
cask "ngrok"
cask "nordvpn"
cask "postman"
cask "provisionql"
cask "qlmarkdown"
cask "quicklook-json"
cask "sequel-pro"
cask "simsim"
cask "skitch"
cask "skype"
cask "spectacle"
cask "spotify"
cask "timing"
cask "virtualbox"
cask "visual-studio-code"
cask "yubico-yubikey-manager"
cask "zeplin"
mas "DevCleaner", id: 1388020431
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
